title: Windows Process Creation
id: win-proc-create-001
status: experimental
description: Detects Windows process creation via Sysmon Event ID 1.
references:
  - https://attack.mitre.org/techniques/T1059/
author: purple-loop
date: 2026/07/04
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
      - '\net.exe'
      - '\net1.exe'
      - '\cmd.exe'
      - '\powershell.exe'
      - '\whoami.exe'
  condition: selection
falsepositives:
  - Legitimate administrative use of net.exe
level: low
tags:
  - attack.execution
  - attack.t1059
