title: Discovery - T1069.001
id: 2d3e4d06-0000-0000-0000-000000000000
status: experimental
description: Detects T1069.001 discovery activity.
references:
  - https://attack.mitre.org/techniques/T1069/001/
author: purple-loop
date: 2026/07/04
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    Image|endswith:
      - '/id'
      - '/whoami'
  condition: selection
falsepositives:
  - Legitimate administrative scripts
level: low
tags:
  - attack.discovery
  - attack.T1069001
