title: Discovery - T1135
id: 59fe172d-0000-0000-0000-000000000000
status: experimental
description: Detects T1135 discovery activity.
references:
  - https://attack.mitre.org/techniques/T1135/
author: purple-loop
date: 2026/07/04
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    Image|endswith:
      - '/id'
      - '/whoami'
  condition: selection
falsepositives:
  - Legitimate administrative scripts
level: low
tags:
  - attack.discovery
  - attack.T1135
